- SQL Installation
- Table Creation
- Python Driver Installation

In [1]:
# !sudo apt-get -y install mysql-server
# !service mysql start
# !pip install mysql-connector-python
# !pip install sqlalchemy
# !pip install ipython-sql
# !pip install mysqlclient
# !sudo mysql -u root -p root -e "CREATE DATABASE demo" # create demo db

In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/demo

In [15]:
%sql show tables

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [16]:
%%sql
-- Create the Department table
CREATE TABLE department (
    id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL
);

-- Insert data into the Department table
INSERT INTO department (id, name) VALUES
(1, 'IT'),
(2, 'Sales');

-- Create the Employee table
CREATE TABLE employee (
    id INT PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    salary DECIMAL(10, 2) NOT NULL,
    departmentId INT,
    FOREIGN KEY (departmentId) REFERENCES department(id)
);

-- Insert data into the Employee table
INSERT INTO employee (id, name, salary, departmentId) VALUES
(1, 'Joe', 70000, 1),
(2, 'Jim', 90000, 1),
(3, 'Henry', 80000, 2),
(4, 'Sam', 60000, 2),
(5, 'Max', 90000, 1);

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.
2 rows affected.
0 rows affected.
5 rows affected.

[]

In [18]:
%%sql
select * from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

In [19]:
%%sql
select * from department

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'IT'), (2, 'Sales')]

- Show all dbs

In [20]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('demo',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',)]

- Select a db

In [22]:
%%sql
use demo;

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

- Show tables in db

In [23]:
%%sql
show tables

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[('department',), ('employee',)]

- Explore table

In [25]:
%%sql
select * from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- Select unique column values

In [28]:
%%sql
select distinct(salary) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(Decimal('70000.00'),),
 (Decimal('90000.00'),),
 (Decimal('80000.00'),),
 (Decimal('60000.00'),)]

- Count distinct

In [29]:
%%sql
select count(distinct(salary)) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(4,)]

- filter records based on condition

In [31]:
%%sql
select * from employee where departmentId=1

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (5, 'Max', Decimal('90000.00'), 1)]

- comparison operators in where clause
- can use >,<,=,<=,>=,!= etc.
- != is same as <>

In [34]:
%%sql
select * from employee where salary >= 80000

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- Between clause
- ends are inclusive here

In [35]:
%%sql
select * from employee where salary between 60000 and 80000

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2)]

- In clause

In [37]:
%%sql
select * from employee where salary in (70000,80000)

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1), (3, 'Henry', Decimal('80000.00'), 2)]

- Sort the records
- Default is asc if nothing is specified

In [42]:
%%sql
select * from employee order by salary asc

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(4, 'Sam', Decimal('60000.00'), 2),
 (1, 'Joe', Decimal('70000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (2, 'Jim', Decimal('90000.00'), 1),
 (5, 'Max', Decimal('90000.00'), 1)]

In [43]:
%%sql
select * from employee order by salary desc

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (5, 'Max', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (1, 'Joe', Decimal('70000.00'), 1),
 (4, 'Sam', Decimal('60000.00'), 2)]

- Sort by multiple columns asc/desc

In [46]:
%%sql
select * from employee order by salary desc, name asc

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (5, 'Max', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (1, 'Joe', Decimal('70000.00'), 1),
 (4, 'Sam', Decimal('60000.00'), 2)]

- Like operator
- % = zero, one or more characters

In [49]:
%%sql
select * from employee where name like "J%"

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1), (2, 'Jim', Decimal('90000.00'), 1)]

- Where + and clause

In [52]:
%%sql
select * from employee where departmentId = 1 and salary >= 70000

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (5, 'Max', Decimal('90000.00'), 1)]

- or clause

In [53]:
%%sql
select * from employee where departmentId = 1 or salary >= 70000

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- not clause

In [61]:
%%sql
select * from employee where not departmentId = 1

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(3, 'Henry', Decimal('80000.00'), 2), (4, 'Sam', Decimal('60000.00'), 2)]

In [62]:
%%sql
select * from employee where salary not between 70000 and 80000

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- not in operator

In [63]:
%%sql
select * from employee where salary not in (80000,90000)

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1), (4, 'Sam', Decimal('60000.00'), 2)]

- checking for null values

In [65]:
%%sql
select * from employee where name is null

 * mysql+mysqlconnector://root:***@localhost/demo
0 rows affected.

[]

In [66]:
%%sql
select * from employee where name is not null

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- limit clause

In [68]:
%%sql
select * from employee limit 2

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1), (2, 'Jim', Decimal('90000.00'), 1)]

- Column Aggregations

In [69]:
%%sql
select min(salary) from employee;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(Decimal('60000.00'),)]

- Column Alias

In [72]:
%%sql
select max(salary) as max_salary from employee;

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(Decimal('90000.00'),)]

- Aggregation within a group

In [74]:
%%sql
select departmentId,min(salary) as min_salary from employee group by departmentId

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, Decimal('70000.00')), (2, Decimal('60000.00'))]

- Count total rows

In [75]:
%%sql
select count(*) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(5,)]

- Count **non null** values in a column

In [76]:
%%sql
select count(name) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(5,)]

- Aggregation + Alias + Filtering

In [78]:
%%sql
select sum(salary) as dept1_salaries from employee where departmentId=1

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(Decimal('250000.00'),)]

- Aggregation within a Group + Alias + Sorting

In [81]:
%%sql
select departmentId,sum(salary) as dept_salaries_total from employee group by 1

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, Decimal('250000.00')), (2, Decimal('140000.00'))]

- Column Operations

In [85]:
%%sql
select name,departmentId,round(salary/1000) as salary_in_thousand from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Joe', 1, Decimal('70')),
 ('Jim', 1, Decimal('90')),
 ('Henry', 2, Decimal('80')),
 ('Sam', 2, Decimal('60')),
 ('Max', 1, Decimal('90'))]

- Get employees getting higher than average salaries (Nested Subquery)

In [86]:
%%sql
select * from employee where salary > (
    select avg(salary) from employee
)

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- Get employees getting higher than average salaries **within** department (Correlated Subquery)

In [94]:
%%sql
select * from employee e1 where salary > (
    select avg(salary) from employee e2 where e2.departmentId = e1.departmentId
)

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

Examples of **like** filter:
- % = zero, one or more chars
- _ = exactly 1 char
- J% = starts with J
- %s = ends with s
- b%s = starts with b and ends with s
- %or% = contains or

In [98]:
%%sql
select * from employee where name like 'J__'

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1), (2, 'Jim', Decimal('90000.00'), 1)]

- Texts are compared in alphabetical order for **between** or >= etc...

In [116]:
%%sql
select * from employee where name between 'M' and 'T'

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(4, 'Sam', Decimal('60000.00'), 2), (5, 'Max', Decimal('90000.00'), 1)]

In [119]:
%%sql
select * from employee where name > 'Ma'

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(4, 'Sam', Decimal('60000.00'), 2), (5, 'Max', Decimal('90000.00'), 1)]

- Alias of column: as keyword is optional

In [123]:
%%sql
select *,name n from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'Joe'),
 (2, 'Jim', Decimal('90000.00'), 1, 'Jim'),
 (3, 'Henry', Decimal('80000.00'), 2, 'Henry'),
 (4, 'Sam', Decimal('60000.00'), 2, 'Sam'),
 (5, 'Max', Decimal('90000.00'), 1, 'Max')]

- Concat columns

In [129]:
%%sql
select *, concat(name,departmentId) "name_deptId" from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'Joe1'),
 (2, 'Jim', Decimal('90000.00'), 1, 'Jim1'),
 (3, 'Henry', Decimal('80000.00'), 2, 'Henry2'),
 (4, 'Sam', Decimal('60000.00'), 2, 'Sam2'),
 (5, 'Max', Decimal('90000.00'), 1, 'Max1')]

- Join + Table Alias
- Supported Join Types: Left, Right, Inner
- Default = inner join

In [191]:
%%sql
select * from employee e left join department d on e.departmentId=d.id

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 1, 'IT'),
 (2, 'Jim', Decimal('90000.00'), 1, 1, 'IT'),
 (3, 'Henry', Decimal('80000.00'), 2, 2, 'Sales'),
 (4, 'Sam', Decimal('60000.00'), 2, 2, 'Sales'),
 (5, 'Max', Decimal('90000.00'), 1, 1, 'IT')]

- Self Join Example
- (Ex. Find people with same salaries)

In [187]:
%%sql
select * from employee e1 inner join employee e2
on e1.salary = e2.salary
and e1.name != e2.name

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(5, 'Max', Decimal('90000.00'), 1, 2, 'Jim', Decimal('90000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1, 5, 'Max', Decimal('90000.00'), 1)]

- Alternate Syntax for Inner/Self Join

In [190]:
%%sql
select * from employee e1, employee e2
where e1.salary = e2.salary
and e1.name != e2.name

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(5, 'Max', Decimal('90000.00'), 1, 2, 'Jim', Decimal('90000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1, 5, 'Max', Decimal('90000.00'), 1)]

- union -> combines two datasets with below conditions
 - both have same number of columns
 - order of columns is same
 - data type of corresponding columns must be same
- union = drop duplicates, union all = allow duplicates

In [209]:
%%sql
select * from employee where departmentId = 1
union
select * from employee where salary = 80000

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (5, 'Max', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2)]

- Use literals to fill column

In [210]:
%%sql
select *,'ABC' as company_name from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'ABC'),
 (2, 'Jim', Decimal('90000.00'), 1, 'ABC'),
 (3, 'Henry', Decimal('80000.00'), 2, 'ABC'),
 (4, 'Sam', Decimal('60000.00'), 2, 'ABC'),
 (5, 'Max', Decimal('90000.00'), 1, 'ABC')]

- Find max salary in each department and make a new column for that!
- Use nested subqueries + correlated subqueries

In [214]:
%%sql
select *,(
    select max(salary) from employee e2
    where e2.departmentId = e1.departmentId
) dept_max from employee e1

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, Decimal('90000.00')),
 (2, 'Jim', Decimal('90000.00'), 1, Decimal('90000.00')),
 (3, 'Henry', Decimal('80000.00'), 2, Decimal('80000.00')),
 (4, 'Sam', Decimal('60000.00'), 2, Decimal('80000.00')),
 (5, 'Max', Decimal('90000.00'), 1, Decimal('90000.00'))]

- Having clause = used to filter after a group by!

In [218]:
%%sql
select departmentId, max(salary) from employee
group by departmentId
having count(*)>2

 * mysql+mysqlconnector://root:***@localhost/demo
1 rows affected.

[(1, Decimal('90000.00'))]

- Single Line Comment

In [219]:
%%sql
-- a comment
select * from employee limit 3;

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2)]

- Multiline comment

In [220]:
%%sql
/*
a multiline
comment
*/
select * from employee limit 3;

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2)]

- Ignore a part of SQL Code!

In [225]:
%%sql
select name, /*salary,*/ departmentId from employee;

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[('Joe', 1), ('Jim', 1), ('Henry', 2), ('Sam', 2), ('Max', 1)]

- offset clause = skips given number of rows
- used with limit clause only

In [233]:
%%sql
select * from employee order by id limit 5 offset 1

 * mysql+mysqlconnector://root:***@localhost/demo
4 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- group by 1 = selects 1st column in select query
- order by 1 = selects 1st column in select query

In [238]:
%%sql
select departmentId, round(avg(salary)) as avg_salary
from employee
group by 1
order by 2 desc

 * mysql+mysqlconnector://root:***@localhost/demo
2 rows affected.

[(1, Decimal('83333')), (2, Decimal('70000'))]

- any clause = the value must be in **any** of the result set returned by the subquery

In [249]:
%%sql
select * from employee where departmentId >= any(select id from department where name="IT")

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- all clause = the value must be equal/greater etc than **all** values of result set

In [250]:
%%sql
select * from employee where departmentId >= all(select id from department where name="IT")

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1),
 (2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (4, 'Sam', Decimal('60000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- Date time fns
- now() = current datetime
- currdate() = current date
- currtime() = current time

In [268]:
%%sql
select now(),curdate(),curtime() from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(datetime.datetime(2024, 9, 9, 23, 43, 53), datetime.date(2024, 9, 9), datetime.timedelta(seconds=85433)),
 (datetime.datetime(2024, 9, 9, 23, 43, 53), datetime.date(2024, 9, 9), datetime.timedelta(seconds=85433)),
 (datetime.datetime(2024, 9, 9, 23, 43, 53), datetime.date(2024, 9, 9), datetime.timedelta(seconds=85433)),
 (datetime.datetime(2024, 9, 9, 23, 43, 53), datetime.date(2024, 9, 9), datetime.timedelta(seconds=85433)),
 (datetime.datetime(2024, 9, 9, 23, 43, 53), datetime.date(2024, 9, 9), datetime.timedelta(seconds=85433))]

- date() -> extracts date from datetime
- time() -> extracts time from datetime
- year()/month()/day()/hour()/minute() -> extract from datetime!

In [276]:
%%sql
select date(now()),time(now()),year(now()),month(now()),day(now()) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(datetime.date(2024, 9, 9), datetime.timedelta(seconds=85568), 2024, 9, 9),
 (datetime.date(2024, 9, 9), datetime.timedelta(seconds=85568), 2024, 9, 9),
 (datetime.date(2024, 9, 9), datetime.timedelta(seconds=85568), 2024, 9, 9),
 (datetime.date(2024, 9, 9), datetime.timedelta(seconds=85568), 2024, 9, 9),
 (datetime.date(2024, 9, 9), datetime.timedelta(seconds=85568), 2024, 9, 9)]

- Add/subtract dates

In [282]:
%%sql
select now(),date_add(now(), interval 5 day),date_sub(now(),interval 1 month) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(datetime.datetime(2024, 9, 9, 23, 47, 19), datetime.datetime(2024, 9, 14, 23, 47, 19), datetime.datetime(2024, 8, 9, 23, 47, 19)),
 (datetime.datetime(2024, 9, 9, 23, 47, 19), datetime.datetime(2024, 9, 14, 23, 47, 19), datetime.datetime(2024, 8, 9, 23, 47, 19)),
 (datetime.datetime(2024, 9, 9, 23, 47, 19), datetime.datetime(2024, 9, 14, 23, 47, 19), datetime.datetime(2024, 8, 9, 23, 47, 19)),
 (datetime.datetime(2024, 9, 9, 23, 47, 19), datetime.datetime(2024, 9, 14, 23, 47, 19), datetime.datetime(2024, 8, 9, 23, 47, 19)),
 (datetime.datetime(2024, 9, 9, 23, 47, 19), datetime.datetime(2024, 9, 14, 23, 47, 19), datetime.datetime(2024, 8, 9, 23, 47, 19))]

- String functions
- concat = concatenation

In [284]:
%%sql
select *,concat(name," ","test!") from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'Joe test!'),
 (2, 'Jim', Decimal('90000.00'), 1, 'Jim test!'),
 (3, 'Henry', Decimal('80000.00'), 2, 'Henry test!'),
 (4, 'Sam', Decimal('60000.00'), 2, 'Sam test!'),
 (5, 'Max', Decimal('90000.00'), 1, 'Max test!')]

In [289]:
%%sql
select *,substring(name,1,2) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'Jo'),
 (2, 'Jim', Decimal('90000.00'), 1, 'Ji'),
 (3, 'Henry', Decimal('80000.00'), 2, 'He'),
 (4, 'Sam', Decimal('60000.00'), 2, 'Sa'),
 (5, 'Max', Decimal('90000.00'), 1, 'Ma')]

In [293]:
%%sql
select *,left(name,2) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'Jo'),
 (2, 'Jim', Decimal('90000.00'), 1, 'Ji'),
 (3, 'Henry', Decimal('80000.00'), 2, 'He'),
 (4, 'Sam', Decimal('60000.00'), 2, 'Sa'),
 (5, 'Max', Decimal('90000.00'), 1, 'Ma')]

In [292]:
%%sql
select *,right(name,2) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'oe'),
 (2, 'Jim', Decimal('90000.00'), 1, 'im'),
 (3, 'Henry', Decimal('80000.00'), 2, 'ry'),
 (4, 'Sam', Decimal('60000.00'), 2, 'am'),
 (5, 'Max', Decimal('90000.00'), 1, 'ax')]

In [295]:
%%sql
select *,length(name) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 3),
 (2, 'Jim', Decimal('90000.00'), 1, 3),
 (3, 'Henry', Decimal('80000.00'), 2, 5),
 (4, 'Sam', Decimal('60000.00'), 2, 3),
 (5, 'Max', Decimal('90000.00'), 1, 3)]

In [297]:
%%sql
select *,upper(name),lower(name) from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, 'JOE', 'joe'),
 (2, 'Jim', Decimal('90000.00'), 1, 'JIM', 'jim'),
 (3, 'Henry', Decimal('80000.00'), 2, 'HENRY', 'henry'),
 (4, 'Sam', Decimal('60000.00'), 2, 'SAM', 'sam'),
 (5, 'Max', Decimal('90000.00'), 1, 'MAX', 'max')]

- cte = common table expressions
- use case = save result set in temp table

In [301]:
%%sql
with cte as (
    select avg(salary) from employee
)
select * from employee where salary >= (select * from cte)

 * mysql+mysqlconnector://root:***@localhost/demo
3 rows affected.

[(2, 'Jim', Decimal('90000.00'), 1),
 (3, 'Henry', Decimal('80000.00'), 2),
 (5, 'Max', Decimal('90000.00'), 1)]

- windows functions
- Example find people with max salary in each department

In [303]:
%%sql
select *, 
max(salary) over (partition by departmentId) as max_salary_in_dept
from employee

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(1, 'Joe', Decimal('70000.00'), 1, Decimal('90000.00')),
 (2, 'Jim', Decimal('90000.00'), 1, Decimal('90000.00')),
 (5, 'Max', Decimal('90000.00'), 1, Decimal('90000.00')),
 (3, 'Henry', Decimal('80000.00'), 2, Decimal('80000.00')),
 (4, 'Sam', Decimal('60000.00'), 2, Decimal('80000.00'))]

- Window fns: find rank of a column!
- row number = in case of tie, assign different ranks randomly!
- rank = assign equal rank if tie, but create a gap!
- dense rank = assign equal rank if tie, but no gaps

In [312]:
%%sql
select *,
row_number() over(order by salary) as salary_rank
from employee
order by salary asc

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(4, 'Sam', Decimal('60000.00'), 2, 1),
 (1, 'Joe', Decimal('70000.00'), 1, 2),
 (3, 'Henry', Decimal('80000.00'), 2, 3),
 (2, 'Jim', Decimal('90000.00'), 1, 4),
 (5, 'Max', Decimal('90000.00'), 1, 5)]

In [313]:
%%sql
select *,
rank() over(order by salary) as salary_rank
from employee
order by salary asc

 * mysql+mysqlconnector://root:***@localhost/demo
5 rows affected.

[(4, 'Sam', Decimal('60000.00'), 2, 1),
 (1, 'Joe', Decimal('70000.00'), 1, 2),
 (3, 'Henry', Decimal('80000.00'), 2, 3),
 (2, 'Jim', Decimal('90000.00'), 1, 4),
 (5, 'Max', Decimal('90000.00'), 1, 4)]